Revit 2027 API
BuiltInFailures.AutoRouteFailures.FailToIntersectParallelSegmentsWarning Property
 The solution is failing to do segments which are parallel and should intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailToIntersectParallelSegmentsWarning { get; }
Public Shared ReadOnly Property FailToIntersectParallelSegmentsWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailToIntersectParallelSegmentsWarning {
	FailureDefinitionId^ get ();
}
static member FailToIntersectParallelSegmentsWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace